app/controllers/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `blogs`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
---
  def index
    @blogs = Blog.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `blogs` (`text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('atra', 'wga', '2019-02-03 11:43:17', '2019-02-03 11:43:17', 3)
---
  def create
      Blog.create(create_params)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 5 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 5
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy if blog.user_id == current_user.id

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 6 LIMIT 1
---
   def edit
      @blog = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 6 LIMIT 1
UPDATE `blogs` SET `image` = 'aaaa', `text` = 'こんにちわ', `updated_at` = '2019-02-03 08:52:43' WHERE `blogs`.`id` = 6
---
    def update
      blog = Blog.find(params[:id])
      if blog.user_id == current_user.id
        blog.update(blog_params)