app/controllers/users_controller.rb

def show
      @nickname = current_user.nickname
      @blogs = current_user.blogs.page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 2 ORDER BY created_at DESC LIMIT 5 OFFSET 0